<template>
  <div class="d-flex flex-column">
    <v-app-bar class="header" elevation="2">
      <p class="my-auto black-font">قوانین سایت</p>
      <v-spacer></v-spacer>
      <v-btn icon @click="close">
        <v-icon color="primary"> mdi-close </v-icon>
      </v-btn>
    </v-app-bar>

    <div class="policies-container">
      <h2 class="policies-title bold-font">به وب سایت فروشگاه <span style="color: var(--primary-color)">پالوت</span> خوش آمدید</h2>
      <p class="policies-text medium-font my-3">
        قوانینی که در ذیل آمده مربوط به همه صفحات سایت paloot-onlineshop.com است
        و هرگونه استفاده و بهره برداری از این سایت به معنی پذیرفتن همه قوانین
        ذیل می‌باشد
      </p>
      <ul class="policies-list mx-3 my-3">
        <li class="regular-font">
          کاربر سایت باید شخص حقیقی بالای هجده سال و یا شرکت حقوقی ثبت شده در
          اداره ثبت شرکت‌ها باشد.
        </li>
        <li class="regular-font">
          صحت مشخصات و اطلاعات مندرج در همه فرم‌های سایت به عهده کاربر می‌باشد و درصورت تغییر، کاربر موظف به اطلاع‌رسانی کتبی به پالوت است. لذا پالوت مسئولیتی در قبال اطلاعات غلط وارد شده توسط کاربر در هر قسمتی از سایت را ندارد و همچنین در صورت تحمیل هزینه‌ای بابت اطلاعات اشتباه به پالوت کاربر موظف به پرداخت آن هزینه می باشد.
        </li>
        <li class="regular-font"> 
          شفاف بودن و درج کامل آدرس و مشخصات دقیق سفارش درخواستی به عهده مشتری است و در صورت انجام و ارسال کالای اشتباه به واسطه مبهم بودن اطلاعات وارده توسط مشتری، پالوت مسئولیتی در قبال استرداد وجه پرداختی و یا تعویض یا مرجوع نمودن کالا را ندارد.
        </li>
        <li class="regular-font">
          کالا و سفارشات درخواستی کاربر باید منطبق بر قوانین جمهوری اسلامی ایران و قوانین پستی و گمرکی باشد و پالوت مسئولیتی در قبال سفارشات غیر قانونی و موجود در لیست کالاهای ممنوعه را ندارد. در صورتی‌که به دلیل قصور کارشناسان پالوت کالای ممنوعه خریداری شود و در گمرکات یا پست‌های درون‌مرزی یا برون‌مرزی دچار مشکل شود پالوت هیچ‌گونه مسئولیتی را نمی‌پذیرد.
        </li>
        <li class="regular-font">
          پالوت تا قبل از دریافت کامل مبلغ پیش فاکتور ارسالی به مشتری هیچگونه مسئولیتی بابت خرید و تحویل سفارش ندارد و مسئولیت پالوت در قبال سفارش مشتری تنها پس از تسویه کامل پیش فاکتور آغاز می‌گردد.
        </li>
        <li class="regular-font">
          کیفیت، اصالت، کارایی و سلامت محصول انتخابی و اعتبار فروشنده آن به عهده مشتری است و پالوت نسبت به موارد فوق مسئولیتی ندارد. و در صورتی که مغایرتی (رنگ ، سایز و...) از طرف کاربر و یا تلقی متفاوتی از آنچه فروشنده اعلام کرده است صورت گرفته باشد، شامل خدمات پالوت نخواهد شد، به طور مثال سایز XL  و یا رنگ آبی تنها در صورتی شامل خدمات پالوت قرار خواهد گرفت که کالای ارسال شده تگی غیر از XL و رنگ آبی داشته باشد، بزرگی و کوچکی و یا تفاوت چشمی رنگ از موارد شامل خدمات پالوت نمی باشد. نقصان و کمبود در مجموعه کالا نیز برعهده فروشنده خارجی بوده و مسئولیتی برعهده پالوت نمی باشد (به طور مثال کمبود یه قطعه در کالای سفارش داده شده)
        </li>
        <li class="regular-font">
          به محض پرداخت وجه پیش فاکتور، توسط مشتری فرایند خرید و سفارش ارسال کالا توسط پالوت قابل اجراست و پالوت متعهد است حداکثر ظرف دو روز کاری خرید را انجام دهد و وجه پرداختی قابل استرداد نمی‌باشد و تنها درصورتی که پالوت به هر دلیلی تا یک هفته موفق به انجام خرید و ثبت سفارش خارجی نگردد تنها موظف به عودت عین وجه ریالی بصورت کامل به مشتری ظرف دو روز کاری می باشد.
        </li>
        <li class="regular-font">
          در صورتی که مشتری به هر دلیلی پس از خرید کالا توسط پالوت تمایل به کنسل کردن سفارش داشته باشد، تنها در صورتی که کالا خریداری نشده باشد امکان کنسل شدن وجود خواهد داشت و مبلغ ریالی پرداختی توسط مشتری طی دو روز کاری توسط پالوت به وی بازگردانده خواهد شد.
        </li>
        <li class="regular-font">
          در صورتی‌که پالوت خرید را انجام دهد اما فروشنده به هر دلیلی کالا را ارسال نکند (مثلا به دلیل اعلام موجودی اشتباه فروشنده و یا اتمام موجودی کالا) و مشتری از پالوت بخواهد تا با انجام شکایت پول را پس بگیرد، مبلغ ریالی پرداختی توسط مشتری طی دو روز کاری پس از عودت وجه توسط فروشنده به وی بازگردانده خواهد شد. بدیهی است در صورت عدم عودت وجه توسط فروشنده، پالوت مسئولیتی در این خصوص ندارد.
        </li>
        <li class="regular-font">
          تعهد زمانی ارسال سفارش به ایران از زمان دریافت کالای سفارش داده شده و تحویل توسط نماینده پالوت در خارج از کشور آغاز می‌شود و زمان تقریبی تحویل آن در ایران در سفارش‌های ترکیه 20 الی 40 روز کاری و کیف و کفش 30 الی 55 روز کاری بجز روزهای تعطیل از زمان دریافت کالا می باشد. لذا پالوت مسئولیتی در قبال تاخیر یا مفقودی ناشی از ارسال کالا توسط فروشنده و یا تاخیرهای پستی در کشور مبداء را ندارد.
        </li>
        <li class="regular-font">
          در صورت ایجاد تاخیر در ارسال سفارش به شرطی که این تاخیر ناشی از عملکرد پالوت ‏باشد، در صورت درخواست به ازای هر هفته‌ای که از زمان تعیین شده برای تحویل سفارش بگذرد، 1% از مبلغ پیش ‌پرداخت به عنوان جریمه تاخیر به مشتری پرداخت خواهد شد.
        </li>
        <li class="regular-font">
          پالوت پس از آماده‌ سازی کالا در دفتر ایران و اطلاع‌رسانی به مشتری جهت تسویه حساب و تحویل کالا، تنها موظف است تا دو هفته کالا را نزد خود نگه دارد. در صورتی که طی این زمان مشتری اقدام به تسویه حساب ننماید، پالوت این اختیار را دارد که کالا را به فروش رساند. در صورت فروش محصول توسط پالوت پس از کسر هزینه کامل حمل و کارمزد خرید مابقی مبلغ پرداختی مشتری عودت می‌گردد. در صورتی که پالوت موفق به فروش کالا نشود هیچ وجهی عودت نمی‌گردد و حق شکایت از مشتری برای پالوت محفوظ است.
        </li>
        <li class="regular-font">
          بسته بندی کالا در هریک از مراحل پست، گمرگات و یا بازرسی‌های فرودگاهی ممکن است باز شود و همچنین امکان حذف بسته‌بندی اضافه محصول به جهت کاهش حجم ارسالی و هزینه پستی برای مشتری وجود دارد. درصورتی که وجود جعبه و بسته‌بندی اوریجینال آن برای مشتری مهم است لازم است به کارشناسان پالوت اعلام شود و هزینه حمل با وزن حجمی بسته را مدنظر قرار دهند.
        </li>
        <li class="regular-font">
          هزینه حمل از ترکیه به ایران پس از دریافت کالا در دفتر ایران بر اساس وزن واقعی محاسبه می‌شود و هنگام تحویل کالا از مشتری دریافت می‌شود مگر اینکه هزینه حمل مساوی یا بیشتر از جمع ارزش کالاها باشد که در این صورت 50 درصد آن در ابتدا محاسبه شده و دریافت می‌گردد. وزن واقعی عبارتست از وزن کالا و جعبه ارسالی از فروشنده روی ترازو و یا وزن حجمی آن در صورت بالاتر بودن، وزن حجمی به گرم به صورت حاصلضرب طول و عرض و ارتفاع مکعب مستطیل فرضی دور کالا  تقسیم بر 5 بدست می آید.
        </li>
        <li class="regular-font">
          در صورت بروز اختلاف، پالوت سعی در حل آن توسط مذاکره و در صورت حل نشدن تعیین داور مرضی الطرفین می‌نمایند. چنانچه مذاکرات تا دو هفته به نتیجه ای نرسد یا داور مورد توافق پیدا نشود، مراجع ذی صلاح قانونی و رای ایشان مرجع طرفین خواهد بود.
        </li>
        <li class="regular-font">
          پالوت در قطع یا محدود سازی ارائه خدمات به کاربران مختار است. همچنین اگر بصورت قطعی مشخص گردد که کاربر اقدام به فعالیت‌ یا مبادلات ممنوعه نموده، پالوت مختار به قطع انجام تعهدات، عدم انجام تراکنش مالی مربوط، اطلاع به مراجع قانونی و قطع دسترسی مشتری می‌باشد.
        </li>
      </ul>

      <div class="policies-items my-6 mx-3">
        <div class="policies-item my-3">
          <h3>
            حقوق و مالکیت سایت
          </h3>
          <p class="my-3">
            دامنه paloot-onlineshop.com و نام “پالوت” و لوگوی درج شده در سایت متعلق به شخص حقیقی بوده و بدون کسب اجازه کتبی، هر گونه کپی برداری و استفاده از موارد فوق ممنوع خواهد بود. علاوه بر آن اسناد، قوانین، فرم‏ها، طرح سربرگ صفحات، شکل‌های گرافیکی و دکمه‌ها، کلیه محتویات وب‌سایت، اطلاعات، طراحی، متون، گرافیک، و موارد مشابه بخشی از مالکیت انحصاری پالوت بوده و بدون کسب اجازه کتبی، کپی‌برداری از آن‌ها ممنوع است.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            محصولات غیر مجاز یا غیر قابل خرید
          </h3>
          <p class="my-3">
            بر اساس ساختار وب سایت پالوت محصولات غیرمجاز و یا غیر قابل ارسال به کشور نمایش داده نمی شود، ولی در صورتی که اشتباها محصول غیر مجاز نمایش داده شده باشد و خرید انجام شود، پالوت حق دارد سفارش را لغو نموده و نسبت به بازگرداندن مبلغ پرداخت شده به حساب مشتری طی دو روز کاری اقدام نماید
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            توقف، بازرسی و یا توقیف محموله
          </h3>
          <p class="my-3">
            پالوت تمام تلاش خود را جهت حمل سریع و ترخیص آسان محموله های مشتریان به کار می بندد، اما در صورت توقف، بازرسی و یا توقیف محموله در گمرک جمهوری اسلامی ایران و بازرسی در طول مسیر حمل، مسئولیتی در قبال تاخیر و یا عدم تحویل کالا نخواهد داشت، در صورت توقیف کالا توسط گمرکات و یا سایر واحد های بازرسی ذیصلاح، بایستی هزینه های ذیربط شامل هزینه های ترخیص، انبارداری، حمل و… توسط صاحب کالا به طور کامل پرداخت گردد.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            باز کردن بسته بندی در صورت لزوم
          </h3>
          <p class="my-3">
            با توجه به این که کلیه سفارشات به صورت رسمی از طریق گمرک جمهوری اسلامی ایران وارد کشور می شوند، ممکن است برخی محصولات جهت بررسی توسط گمرک باز و از حالت پلمپ خارج شوند، لذا امکان باز شدن تمام بسته بندی ها وجود داشته و پالوت حق باز کردن بسته بندی تمام کالا ها را برای خود محفوظ می­ دارد.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            شرط عدم مسئولیت
          </h3>
          <p class="my-3">
            سایت و هیچ یک از ارگان‏‌های اصلی یا فرعی آن به هیچ وجه مسئول خسارات اتفاقی، غیرقابل ‌پیش‌بینی، تبعی و عدم‌ النفع در قبال کاربران نیست، مسئولیت پالوت و کارکنان آن محدود به خسارات مستقیم و بلاواسطه‌ایی است که با اثبات تقصیر سایت به کاربران یا اشخاص ثالث وارد شده است. در صورتی كه ثابت شود ورود خسارت در نتیجه ی اهمال، تقصیر و یا نقض تعهدات قانونی یا قراردادی كاربر و یا از ناحیهی فروشنده بوده است سایت متکلف به پرداخت هیچ خسارتی نخواهد بود و همچنین در صورتی كه احراز گردد وقوع حالت فورس ماژور یا قوه قهریه باعث ایجاد خسارت گردیده است، سایت از مسئولیت بری خواهد بود.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            خسارات احتمالی
          </h3>
          <p class="my-3">
            سایت هیچ‌گونه مسئولیتی در خصوص زیان‌ها و خسارت‌های احتمالی ناشی از عملکرد گروه و پرسنل به اعضای آن نداشته و حداکثر خسارت‌های قابل پرداخت معادل کارمزد خدمات ارائه شده به شخص مدعی خواهد بود.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            کسورات
          </h3>
          <p class="my-3">
            پالوت در قبال صحت اظهارات كاربران در خصوص کسوراتی از قبیل مالیات، عوارض و دیگر مطالبات قانونی که به مبالغ دریافتی یا پرداختی تعلق می‏‌گیرد مسئولیتی ندارد و مسئول پرداخت این کسورات نخواهد بود.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            عدم تضمین
          </h3>
          <p class="my-3">
            سایت خدمات خود را تنها طبق شروطی که در این توافق‌نامه بیان شده ارائه می‌نماید و هیچ تضمین و شرط اضافی دیگر را نپذیرفته و تضمین می‌کند که خریدار یا فروشنده به همهی شروط معامله پایبند باشند.
          </p>
        </div>
        <div class="policies-item my-3">
          <h3>
            انتشار مطالب
          </h3>
          <p class="my-3">
            با پذیرش این توافق‌نامه کاربران قبول می‌کنند سایت هیچ‌گونه مسئولیتی در خصوص ادعاها و مطالب گمراه کننده، نادرست، مضر و موهن مندرج در سایت ندارد. بدیهی است به محض اطلاع و رؤیت هر‌گونه اطلاعات غیر اخلاقی، غیرشرعی و ناهنجار اطلاعات مذکور از سایت حذف خواهد شد.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Rules",
  methods: {
    close() {
      this.$store.commit("profile/updateSelectedMenuItem", -1);
    },
  },
};
</script>

<style scoped>
.policies-container {
  padding: 20px;
  border-radius: 5px;
  font-family: 'Segoe UI', sans-serif;
  color: #333;
  overflow-y: auto;
}

.policies-title {
  font-size: 2rem;
}

.policies-text {
  font-size: 1.2rem;
}

.policies-list {
  font-size: 1.1rem;
  list-style: disc;
  margin-left: 20px;
}

ul {
  list-style: none !important; /* Remove default bullets */
}

ul li::before {
  content: "\2022";  /* Add content: \2022 is the CSS Code/unicode for a bullet */
  color: var(--primary-color); /* Change the color */
  font-weight: bold; /* If you want it to be bold */
  display: inline-block; /* Needed to add space between the bullet and the text */
  width: 1em; /* Also needed for space (tweak if needed) */
  margin-left: -5px; /* Also needed for space (tweak if needed) */
  font-size: 20px;
}

li {
  direction: rtl;
  text-align: right;
  margin: 1rem 0;
  color: rgb(128, 128, 128);
  font-size: 17px;
}


.policies-item h3 {
  font-family: "Bold";
}

.policies-item p {
  font-family: "Regular";
}
</style>